package code17_bitmap1;

/// 图的说明
public class Code01_bitmapDescription {

//    在计算机科学中，图是一种由节点（或顶点）和连接这些节点的边（或弧）组成的数学结构。图的表示和操作在很多领域都非常重要，包括网络、社交媒体、生物信息学等。
//
//    图的基本组成部分
//    1.节点（Vertices）：图中的基本单位，表示对象（例如城市、用户等）。
//    2.边（Edges）：连接节点的线，表示对象之间的关系（例如城市之间的连接、用户之间的好友关系等）。
//
//    图的分类
//    1.无向图：边没有方向，表示两个节点之间的双向关系。
//    2.有向图：边有方向，表示从一个节点到另一个节点的单向关系。
//    3.加权图：边有权重，表示连接的强度或成本。
//    4.连通图：图中任意两个节点都是连通的。


    /**
     * 图的题目难就难在对数据转换为图的这一步操作
     *
     * 可以写一个适配器，对适用于图的数据进行转换
     *
     * 要自己写一个转换的结构，对题目要求的数据进行一层包装或者转换，这里应该是转换更好一些
     * */

}
